Tekla.Structures.AnalysisInternal.DotAnalysisObject
Ther serialiaztion structore for AnalysisObject.

Tekla.Structures.AnalysisInternal.DotAnalysisObject._AnalysisModelName
The name of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisObject.ID
The identifier of the analysis object.

Tekla.Structures.AnalysisInternal.DotAnalysisObject._AnalysisObjectType
The type of the analysis object.

Tekla.Structures.AnalysisInternal.DotAnalysisObject.FatherObjectID
The identifier of the father object.

Tekla.Structures.AnalysisInternal.DotAnalysisObject._FatherObjectType
The type of the father object.

Tekla.Structures.AnalysisInternal.DotAnalysisObject.FatherObject2ID
The identifier of the father object 2.

Tekla.Structures.AnalysisInternal.DotAnalysisObject._FatherObject2Type
The type of the father object 2.

Tekla.Structures.AnalysisInternal.DotAnalysisObject.ToStruct(Tekla.Structures.Analysis.AnalysisObject)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisObject.FromStruct(Tekla.Structures.Analysis.AnalysisObject)
DO NOT USE! For internal usage only!
P: P.